.sbom/pipdeptree.3.11.dot
digraph {
	"annotated-types" [label="annotated-types\n0.7.0"]
	"antlr4-python3-runtime" [label="antlr4-python3-runtime\n4.13.2"]
	"boolean-py" [label="boolean.py\n5.0"]
	"charset-normalizer" [label="charset-normalizer\n3.4.7"]
	"cyclonedx-bom" -> "cyclonedx-python-lib" [label=">=8.0,<12"]
	"cyclonedx-bom" -> "packageurl-python" [label=">=0.11,<2"]
	"cyclonedx-bom" -> "pip-requirements-parser" [label=">=32.0,<33.0"]
	"cyclonedx-bom" -> chardet [label=">=5.1,<6.0"]
	"cyclonedx-bom" -> packaging [label=">=22,<27"]
	"cyclonedx-bom" [label="cyclonedx-bom\n7.3.0"]
	"cyclonedx-python-lib" -> "license-expression" [label=">=30,<31"]
	"cyclonedx-python-lib" -> "packageurl-python" [label=">=0.11,<2"]
	"cyclonedx-python-lib" -> "py-serializable" [label=">=2.1.0,<3.0.0"]
	"cyclonedx-python-lib" -> "typing-extensions" [label=">=4.6,<5.0"]
	"cyclonedx-python-lib" -> sortedcontainers [label=">=2.4.0,<3.0.0"]
	"cyclonedx-python-lib" [label="cyclonedx-python-lib\n11.7.0"]
	"dagster-graphql" -> dagster [label="==1.9.11"]
	"dagster-graphql" -> gql [label=">=3,<4"]
	"dagster-graphql" -> graphene [label=">=3,<4"]
	"dagster-graphql" -> requests [label=any]
	"dagster-graphql" -> starlette [label=any]
	"dagster-graphql" [label="dagster-graphql\n1.9.11"]
	"dagster-pipes" [label="dagster-pipes\n1.9.11"]
	"dagster-postgres" -> "psycopg2-binary" [label=any]
	"dagster-postgres" -> dagster [label="==1.9.11"]
	"dagster-postgres" [label="dagster-postgres\n0.25.11"]
	"dagster-webserver" -> "dagster-graphql" [label="==1.9.11"]
	"dagster-webserver" -> click [label=">=7.0,<9.0"]
	"dagster-webserver" -> dagster [label="==1.9.11"]
	"dagster-webserver" -> starlette [label="!=0.36.0"]
	"dagster-webserver" -> uvicorn [label=any]
	"dagster-webserver" [label="dagster-webserver\n1.9.11"]
	"dependency-groups" -> packaging [label=any]
	"dependency-groups" [label="dependency-groups\n1.3.1"]
	"docker-compose-graph" -> "python-dotenv" [label=any]
	"docker-compose-graph" -> graphviz [label=any]
	"docker-compose-graph" -> jinja2 [label=any]
	"docker-compose-graph" -> pydot [label=any]
	"docker-compose-graph" -> pyyaml [label=any]
	"docker-compose-graph" [label="docker-compose-graph\n1.0.0.post1.dev5+ga91125bef"]
	"docstring-parser" [label="docstring_parser\n0.17.0"]
	"email-validator" -> dnspython [label=">=2.0.0"]
	"email-validator" -> idna [label=">=2.0.0"]
	"email-validator" [label="email-validator\n2.3.0"]
	"graphql-core" [label="graphql-core\n3.2.6"]
	"graphql-relay" -> "graphql-core" [label=">=3.2,<3.3"]
	"graphql-relay" [label="graphql-relay\n3.2.0"]
	"grpcio-health-checking" -> grpcio [label=">=1.71.2"]
	"grpcio-health-checking" -> protobuf [label=">=5.26.1,<6.0dev"]
	"grpcio-health-checking" [label="grpcio-health-checking\n1.71.2"]
	"human-readable-id" [label="human-readable-id\n0.0.3"]
	"jsonschema-specifications" -> referencing [label=">=0.31.0"]
	"jsonschema-specifications" [label="jsonschema-specifications\n2025.9.1"]
	"license-expression" -> "boolean-py" [label=">=4.0"]
	"license-expression" [label="license-expression\n30.4.4"]
	"markdown-it-py" -> mdurl [label="~=0.1"]
	"markdown-it-py" [label="markdown-it-py\n4.0.0"]
	"openstudiolandscapes-dagstercodelocation-streamingprocess" -> dagster [label="==1.9.11"]
	"openstudiolandscapes-dagstercodelocation-streamingprocess" [label="OpenStudioLandscapes-DagsterCodeLocation-StreamingProcess\n0.0.0"]
	"openstudiolandscapes-flamenco" -> "docker-compose-graph" [label=any]
	"openstudiolandscapes-flamenco" -> "email-validator" [label=any]
	"openstudiolandscapes-flamenco" -> "openstudiolandscapes-dagstercodelocation-streamingprocess" [label=any]
	"openstudiolandscapes-flamenco" -> dagster [label="==1.9.11"]
	"openstudiolandscapes-flamenco" -> gitpython [label=any]
	"openstudiolandscapes-flamenco" -> pyyaml [label=any]
	"openstudiolandscapes-flamenco" -> snakemd [label=any]
	"openstudiolandscapes-flamenco" [label="OpenStudioLandscapes-Flamenco\n0.0.0"]
	"openstudiolandscapes-flamenco-worker" -> "docker-compose-graph" [label=any]
	"openstudiolandscapes-flamenco-worker" -> "email-validator" [label=any]
	"openstudiolandscapes-flamenco-worker" -> "openstudiolandscapes-dagstercodelocation-streamingprocess" [label=any]
	"openstudiolandscapes-flamenco-worker" -> dagster [label="==1.9.11"]
	"openstudiolandscapes-flamenco-worker" -> gitpython [label=any]
	"openstudiolandscapes-flamenco-worker" -> pyyaml [label=any]
	"openstudiolandscapes-flamenco-worker" -> snakemd [label=any]
	"openstudiolandscapes-flamenco-worker" [label="OpenStudioLandscapes-Flamenco-Worker\n0.0.0"]
	"packageurl-python" [label="packageurl-python\n0.17.6"]
	"pathlib-abc" [label="pathlib_abc\n0.5.2"]
	"pip-requirements-parser" -> packaging [label=any]
	"pip-requirements-parser" -> pyparsing [label=any]
	"pip-requirements-parser" [label="pip-requirements-parser\n32.0.1"]
	"psycopg2-binary" [label="psycopg2-binary\n2.9.11"]
	"py-serializable" -> defusedxml [label=">=0.7.1,<0.8.0"]
	"py-serializable" [label="py-serializable\n2.1.0"]
	"pydantic-core" -> "typing-extensions" [label=">=4.14.1"]
	"pydantic-core" [label="pydantic_core\n2.41.5"]
	"python-dateutil" -> six [label=">=1.5"]
	"python-dateutil" [label="python-dateutil\n2.9.0.post0"]
	"python-discovery" -> filelock [label=">=3.15.4"]
	"python-discovery" -> platformdirs [label=">=4.3.6,<5"]
	"python-discovery" [label="python-discovery\n1.2.2"]
	"python-dotenv" [label="python-dotenv\n1.2.2"]
	"requests-toolbelt" -> requests [label=">=2.0.1,<3.0.0"]
	"requests-toolbelt" [label="requests-toolbelt\n1.0.0"]
	"rfc3339-validator" -> six [label=any]
	"rfc3339-validator" [label="rfc3339-validator\n0.1.4"]
	"rfc3986-validator" [label="rfc3986-validator\n0.1.1"]
	"rfc3987-syntax" -> lark [label=">=1.2.2"]
	"rfc3987-syntax" [label="rfc3987-syntax\n1.1.0"]
	"rpds-py" [label="rpds-py\n0.30.0"]
	"typing-extensions" [label="typing_extensions\n4.15.0"]
	"typing-inspection" -> "typing-extensions" [label=">=4.12.0"]
	"typing-inspection" [label="typing-inspection\n0.4.2"]
	"universal-pathlib" -> "pathlib-abc" [label=">=0.5.1,<0.6.0"]
	"universal-pathlib" -> fsspec [label=">=2024.5.0"]
	"universal-pathlib" [label="universal_pathlib\n0.3.10"]
	"uri-template" [label="uri-template\n1.3.0"]
	alembic -> "typing-extensions" [label=">=4.12"]
	alembic -> mako [label=any]
	alembic -> sqlalchemy [label=">=1.4.23"]
	alembic [label="alembic\n1.18.4"]
	anyio -> "typing-extensions" [label=">=4.5"]
	anyio -> idna [label=">=2.8"]
	anyio [label="anyio\n4.13.0"]
	argcomplete [label="argcomplete\n3.6.3"]
	arrow -> "python-dateutil" [label=">=2.7.0"]
	arrow -> tzdata [label=any]
	arrow [label="arrow\n1.4.0"]
	attrs [label="attrs\n26.1.0"]
	backoff [label="backoff\n2.2.1"]
	certifi [label="certifi\n2026.2.25"]
	chardet [label="chardet\n5.2.0"]
	click [label="click\n8.3.2"]
	coloredlogs -> humanfriendly [label=">=7.1"]
	coloredlogs [label="coloredlogs\n14.0"]
	colorlog [label="colorlog\n6.10.1"]
	dagster -> "antlr4-python3-runtime" [label=any]
	dagster -> "dagster-pipes" [label="==1.9.11"]
	dagster -> "docstring-parser" [label=any]
	dagster -> "grpcio-health-checking" [label=">=1.44.0"]
	dagster -> "python-dotenv" [label=any]
	dagster -> "typing-extensions" [label=">=4.10.0,<5"]
	dagster -> "universal-pathlib" [label=any]
	dagster -> alembic [label=">=1.2.1,!=1.7.0,!=1.6.3,!=1.11.0"]
	dagster -> click [label=">=5.0"]
	dagster -> coloredlogs [label=">=6.1,<=14.0"]
	dagster -> filelock [label=any]
	dagster -> grpcio [label=">=1.44.0"]
	dagster -> jinja2 [label=any]
	dagster -> packaging [label=">=20.9"]
	dagster -> protobuf [label=">=4,<6"]
	dagster -> pydantic [label=">=2,<3.0.0"]
	dagster -> pytz [label=any]
	dagster -> pyyaml [label=">=5.1"]
	dagster -> requests [label=any]
	dagster -> rich [label=any]
	dagster -> setuptools [label=any]
	dagster -> six [label=any]
	dagster -> sqlalchemy [label=">=1.0,<3"]
	dagster -> structlog [label=any]
	dagster -> tabulate [label=any]
	dagster -> tomli [label="<3"]
	dagster -> toposort [label=">=1.0"]
	dagster -> tqdm [label="<5"]
	dagster -> watchdog [label=">=0.8.3,<6"]
	dagster [label="dagster\n1.9.11"]
	defusedxml [label="defusedxml\n0.7.1"]
	distlib [label="distlib\n0.4.0"]
	dnspython [label="dnspython\n2.8.0"]
	filelock [label="filelock\n3.25.2"]
	fqdn [label="fqdn\n1.5.1"]
	fsspec [label="fsspec\n2026.3.0"]
	gitdb -> smmap [label=">=3.0.1,<6"]
	gitdb [label="gitdb\n4.0.12"]
	gitpython -> gitdb [label=">=4.0.1,<5"]
	gitpython [label="GitPython\n3.1.46"]
	gql -> "graphql-core" [label=">=3.2,<3.2.7"]
	gql -> anyio [label=">=3.0,<5"]
	gql -> backoff [label=">=1.11.1,<3.0"]
	gql -> yarl [label=">=1.6,<2.0"]
	gql [label="gql\n3.5.3"]
	graphene -> "graphql-core" [label=">=3.1,<3.3"]
	graphene -> "graphql-relay" [label=">=3.1,<3.3"]
	graphene -> "python-dateutil" [label=">=2.7.0,<3"]
	graphene -> "typing-extensions" [label=">=4.7.1,<5"]
	graphene [label="graphene\n3.4.3"]
	graphviz [label="graphviz\n0.21"]
	greenlet [label="greenlet\n3.4.0"]
	grpcio -> "typing-extensions" [label="~=4.12"]
	grpcio [label="grpcio\n1.80.0"]
	h11 [label="h11\n0.16.0"]
	httptools [label="httptools\n0.7.1"]
	humanfriendly [label="humanfriendly\n10.0"]
	humanize [label="humanize\n4.15.0"]
	idna [label="idna\n3.11"]
	isoduration -> arrow [label=">=0.15.0"]
	isoduration [label="isoduration\n20.11.0"]
	jinja2 -> markupsafe [label=">=2.0"]
	jinja2 [label="Jinja2\n3.1.6"]
	jsonpointer [label="jsonpointer\n3.1.1"]
	jsonschema -> "jsonschema-specifications" [label=">=2023.03.6"]
	jsonschema -> "rpds-py" [label=">=0.25.0"]
	jsonschema -> attrs [label=">=22.2.0"]
	jsonschema -> referencing [label=">=0.28.4"]
	jsonschema [label="jsonschema\n4.26.0"]
	lark [label="lark\n1.3.1"]
	lxml [label="lxml\n6.0.4"]
	mako -> markupsafe [label=">=0.9.2"]
	mako [label="Mako\n1.3.10"]
	markupsafe [label="MarkupSafe\n3.0.3"]
	mdurl [label="mdurl\n0.1.2"]
	multidict [label="multidict\n6.7.1"]
	nox -> "dependency-groups" [label=">=1.1"]
	nox -> argcomplete [label=">=1.9.4,<4"]
	nox -> attrs [label=">=24.1"]
	nox -> colorlog [label=">=2.6.1,<7"]
	nox -> humanize [label=">=4"]
	nox -> packaging [label=">=22"]
	nox -> virtualenv [label=">=20.15"]
	nox [label="nox\n2026.4.10"]
	openstudiolandscapes -> "dagster-postgres" [label="==0.25.11"]
	openstudiolandscapes -> "dagster-webserver" [label="==1.9.11"]
	openstudiolandscapes -> "docker-compose-graph" [label=any]
	openstudiolandscapes -> "email-validator" [label=any]
	openstudiolandscapes -> "human-readable-id" [label=any]
	openstudiolandscapes -> "openstudiolandscapes-dagstercodelocation-streamingprocess" [label=any]
	openstudiolandscapes -> dagster [label="==1.9.11"]
	openstudiolandscapes -> gitpython [label=any]
	openstudiolandscapes -> nox [label=any]
	openstudiolandscapes -> pydot [label=any]
	openstudiolandscapes -> pyyaml [label=any]
	openstudiolandscapes -> snakemd [label=any]
	openstudiolandscapes [label="OpenStudioLandscapes\n0.0.0"]
	packaging [label="packaging\n26.0"]
	pip [label="pip\n26.0.1"]
	pipdeptree -> packaging [label=">=26"]
	pipdeptree [label="pipdeptree\n2.35.1"]
	platformdirs [label="platformdirs\n4.9.6"]
	propcache [label="propcache\n0.4.1"]
	protobuf [label="protobuf\n5.29.6"]
	pydantic -> "annotated-types" [label=">=0.6.0"]
	pydantic -> "pydantic-core" [label="==2.41.5"]
	pydantic -> "typing-extensions" [label=">=4.14.1"]
	pydantic -> "typing-inspection" [label=">=0.4.2"]
	pydantic [label="pydantic\n2.12.5"]
	pydot -> pyparsing [label=">=3.1.0"]
	pydot [label="pydot\n4.0.1"]
	pygments [label="Pygments\n2.20.0"]
	pyparsing [label="pyparsing\n3.3.2"]
	pytz [label="pytz\n2026.1.post1"]
	pyyaml [label="PyYAML\n6.0.3"]
	referencing -> "rpds-py" [label=">=0.7.0"]
	referencing -> "typing-extensions" [label=">=4.4.0"]
	referencing -> attrs [label=">=22.2.0"]
	referencing [label="referencing\n0.37.0"]
	requests -> "charset-normalizer" [label=">=2,<4"]
	requests -> certifi [label=">=2023.5.7"]
	requests -> idna [label=">=2.5,<4"]
	requests -> urllib3 [label=">=1.26,<3"]
	requests [label="requests\n2.33.1"]
	rich -> "markdown-it-py" [label=">=2.2.0"]
	rich -> pygments [label=">=2.13.0,<3.0.0"]
	rich [label="rich\n15.0.0"]
	setuptools [label="setuptools\n82.0.1"]
	six [label="six\n1.17.0"]
	smmap [label="smmap\n5.0.3"]
	snakemd [label="SnakeMD\n2.4.0"]
	sortedcontainers [label="sortedcontainers\n2.4.0"]
	sqlalchemy -> "typing-extensions" [label=">=4.6.0"]
	sqlalchemy -> greenlet [label=">=1"]
	sqlalchemy [label="SQLAlchemy\n2.0.49"]
	starlette -> "typing-extensions" [label=">=4.10.0"]
	starlette -> anyio [label=">=3.6.2,<5"]
	starlette [label="starlette\n1.0.0"]
	structlog [label="structlog\n25.5.0"]
	tabulate [label="tabulate\n0.10.0"]
	tomli [label="tomli\n2.4.1"]
	toposort [label="toposort\n1.10"]
	tqdm [label="tqdm\n4.67.3"]
	tzdata [label="tzdata\n2026.1"]
	urllib3 [label="urllib3\n2.6.3"]
	uvicorn -> click [label=">=7.0"]
	uvicorn -> h11 [label=">=0.8"]
	uvicorn [label="uvicorn\n0.44.0"]
	uvloop [label="uvloop\n0.22.1"]
	virtualenv -> "python-discovery" [label=">=1"]
	virtualenv -> distlib [label=">=0.3.7,<1"]
	virtualenv -> filelock [label=">=3.24.2,<4"]
	virtualenv -> platformdirs [label=">=3.9.1,<5"]
	virtualenv [label="virtualenv\n21.2.1"]
	watchdog [label="watchdog\n5.0.3"]
	watchfiles -> anyio [label=">=3.0.0"]
	watchfiles [label="watchfiles\n1.1.1"]
	webcolors [label="webcolors\n25.10.0"]
	websockets [label="websockets\n16.0"]
	wheel -> packaging [label=">=24.0"]
	wheel [label="wheel\n0.46.3"]
	yarl -> idna [label=">=2.0"]
	yarl -> multidict [label=">=4.0"]
	yarl -> propcache [label=">=0.2.1"]
	yarl [label="yarl\n1.23.0"]
}
