.sbom/pipdeptree.3.11.mermaid
flowchart TD
    classDef missing stroke-dasharray: 5
    alembic["alembic<br/>1.18.4"]
    annotated-types["annotated-types<br/>0.7.0"]
    antlr4-python3-runtime["antlr4-python3-runtime<br/>4.13.2"]
    anyio["anyio<br/>4.13.0"]
    argcomplete["argcomplete<br/>3.6.3"]
    arrow["arrow<br/>1.4.0"]
    attrs["attrs<br/>26.1.0"]
    backoff["backoff<br/>2.2.1"]
    boolean-py["boolean.py<br/>5.0"]
    certifi["certifi<br/>2026.2.25"]
    chardet["chardet<br/>5.2.0"]
    charset-normalizer["charset-normalizer<br/>3.4.7"]
    click_0["click<br/>8.3.2"]
    coloredlogs["coloredlogs<br/>14.0"]
    colorlog["colorlog<br/>6.10.1"]
    cyclonedx-bom["cyclonedx-bom<br/>7.3.0"]
    cyclonedx-python-lib["cyclonedx-python-lib<br/>11.7.0"]
    dagster-graphql["dagster-graphql<br/>1.9.11"]
    dagster-pipes["dagster-pipes<br/>1.9.11"]
    dagster-postgres["dagster-postgres<br/>0.25.11"]
    dagster-webserver["dagster-webserver<br/>1.9.11"]
    dagster["dagster<br/>1.9.11"]
    defusedxml["defusedxml<br/>0.7.1"]
    dependency-groups["dependency-groups<br/>1.3.1"]
    distlib["distlib<br/>0.4.0"]
    dnspython["dnspython<br/>2.8.0"]
    docker-compose-graph["docker-compose-graph<br/>1.0.0.post1.dev5+ga91125bef"]
    docstring-parser["docstring_parser<br/>0.17.0"]
    email-validator["email-validator<br/>2.3.0"]
    filelock["filelock<br/>3.25.2"]
    fqdn["fqdn<br/>1.5.1"]
    fsspec["fsspec<br/>2026.3.0"]
    gitdb["gitdb<br/>4.0.12"]
    gitpython["GitPython<br/>3.1.46"]
    gql["gql<br/>3.5.3"]
    graphene["graphene<br/>3.4.3"]
    graphql-core["graphql-core<br/>3.2.6"]
    graphql-relay["graphql-relay<br/>3.2.0"]
    graphviz["graphviz<br/>0.21"]
    greenlet["greenlet<br/>3.4.0"]
    grpcio-health-checking["grpcio-health-checking<br/>1.71.2"]
    grpcio["grpcio<br/>1.80.0"]
    h11["h11<br/>0.16.0"]
    httptools["httptools<br/>0.7.1"]
    human-readable-id["human-readable-id<br/>0.0.3"]
    humanfriendly["humanfriendly<br/>10.0"]
    humanize["humanize<br/>4.15.0"]
    idna["idna<br/>3.11"]
    isoduration["isoduration<br/>20.11.0"]
    jinja2["Jinja2<br/>3.1.6"]
    jsonpointer["jsonpointer<br/>3.1.1"]
    jsonschema-specifications["jsonschema-specifications<br/>2025.9.1"]
    jsonschema["jsonschema<br/>4.26.0"]
    lark["lark<br/>1.3.1"]
    license-expression["license-expression<br/>30.4.4"]
    lxml["lxml<br/>6.0.3"]
    mako["Mako<br/>1.3.10"]
    markdown-it-py["markdown-it-py<br/>4.0.0"]
    markupsafe["MarkupSafe<br/>3.0.3"]
    mdurl["mdurl<br/>0.1.2"]
    multidict["multidict<br/>6.7.1"]
    nox["nox<br/>2026.4.10"]
    openstudiolandscapes-dagstercodelocation-streamingprocess["OpenStudioLandscapes-DagsterCodeLocation-StreamingProcess<br/>0.0.0"]
    openstudiolandscapes-flamenco-worker["OpenStudioLandscapes-Flamenco-Worker<br/>0.0.0"]
    openstudiolandscapes-flamenco["OpenStudioLandscapes-Flamenco<br/>0.0.0"]
    openstudiolandscapes["OpenStudioLandscapes<br/>0.0.0"]
    packageurl-python["packageurl-python<br/>0.17.6"]
    packaging["packaging<br/>26.0"]
    pathlib-abc["pathlib_abc<br/>0.5.2"]
    pip-requirements-parser["pip-requirements-parser<br/>32.0.1"]
    pip["pip<br/>26.0.1"]
    pipdeptree["pipdeptree<br/>2.35.1"]
    platformdirs["platformdirs<br/>4.9.6"]
    propcache["propcache<br/>0.4.1"]
    protobuf["protobuf<br/>5.29.6"]
    psycopg2-binary["psycopg2-binary<br/>2.9.11"]
    py-serializable["py-serializable<br/>2.1.0"]
    pydantic-core["pydantic_core<br/>2.41.5"]
    pydantic["pydantic<br/>2.12.5"]
    pydot["pydot<br/>4.0.1"]
    pygments["Pygments<br/>2.20.0"]
    pyparsing["pyparsing<br/>3.3.2"]
    python-dateutil["python-dateutil<br/>2.9.0.post0"]
    python-discovery["python-discovery<br/>1.2.2"]
    python-dotenv["python-dotenv<br/>1.2.2"]
    pytz["pytz<br/>2026.1.post1"]
    pyyaml["PyYAML<br/>6.0.3"]
    referencing["referencing<br/>0.37.0"]
    requests-toolbelt["requests-toolbelt<br/>1.0.0"]
    requests["requests<br/>2.33.1"]
    rfc3339-validator["rfc3339-validator<br/>0.1.4"]
    rfc3986-validator["rfc3986-validator<br/>0.1.1"]
    rfc3987-syntax["rfc3987-syntax<br/>1.1.0"]
    rich["rich<br/>14.3.4"]
    rpds-py["rpds-py<br/>0.30.0"]
    setuptools["setuptools<br/>82.0.1"]
    six["six<br/>1.17.0"]
    smmap["smmap<br/>5.0.3"]
    snakemd["SnakeMD<br/>2.4.0"]
    sortedcontainers["sortedcontainers<br/>2.4.0"]
    sqlalchemy["SQLAlchemy<br/>2.0.49"]
    starlette["starlette<br/>1.0.0"]
    structlog["structlog<br/>25.5.0"]
    tabulate["tabulate<br/>0.10.0"]
    tomli["tomli<br/>2.4.1"]
    toposort["toposort<br/>1.10"]
    tqdm["tqdm<br/>4.67.3"]
    typing-extensions["typing_extensions<br/>4.15.0"]
    typing-inspection["typing-inspection<br/>0.4.2"]
    tzdata["tzdata<br/>2026.1"]
    universal-pathlib["universal_pathlib<br/>0.3.10"]
    uri-template["uri-template<br/>1.3.0"]
    urllib3["urllib3<br/>2.6.3"]
    uvicorn["uvicorn<br/>0.44.0"]
    uvloop["uvloop<br/>0.22.1"]
    virtualenv["virtualenv<br/>21.2.1"]
    watchdog["watchdog<br/>5.0.3"]
    watchfiles["watchfiles<br/>1.1.1"]
    webcolors["webcolors<br/>25.10.0"]
    websockets["websockets<br/>16.0"]
    wheel["wheel<br/>0.46.3"]
    yarl["yarl<br/>1.23.0"]
    alembic -- ">=1.4.23" --> sqlalchemy
    alembic -- ">=4.12" --> typing-extensions
    alembic -- "any" --> mako
    anyio -- ">=2.8" --> idna
    anyio -- ">=4.5" --> typing-extensions
    arrow -- ">=2.7.0" --> python-dateutil
    arrow -- "any" --> tzdata
    coloredlogs -- ">=7.1" --> humanfriendly
    cyclonedx-bom -- ">=0.11,<2" --> packageurl-python
    cyclonedx-bom -- ">=22,<27" --> packaging
    cyclonedx-bom -- ">=32.0,<33.0" --> pip-requirements-parser
    cyclonedx-bom -- ">=5.1,<6.0" --> chardet
    cyclonedx-bom -- ">=8.0,<12" --> cyclonedx-python-lib
    cyclonedx-python-lib -- ">=0.11,<2" --> packageurl-python
    cyclonedx-python-lib -- ">=2.1.0,<3.0.0" --> py-serializable
    cyclonedx-python-lib -- ">=2.4.0,<3.0.0" --> sortedcontainers
    cyclonedx-python-lib -- ">=30,<31" --> license-expression
    cyclonedx-python-lib -- ">=4.6,<5.0" --> typing-extensions
    dagster -- "<3" --> tomli
    dagster -- "<5" --> tqdm
    dagster -- "==1.9.11" --> dagster-pipes
    dagster -- ">=0.8.3,<6" --> watchdog
    dagster -- ">=1.0" --> toposort
    dagster -- ">=1.0,<3" --> sqlalchemy
    dagster -- ">=1.2.1,!=1.7.0,!=1.6.3,!=1.11.0" --> alembic
    dagster -- ">=1.44.0" --> grpcio
    dagster -- ">=1.44.0" --> grpcio-health-checking
    dagster -- ">=2,<3.0.0" --> pydantic
    dagster -- ">=20.9" --> packaging
    dagster -- ">=4,<6" --> protobuf
    dagster -- ">=4.10.0,<5" --> typing-extensions
    dagster -- ">=5.0" --> click_0
    dagster -- ">=5.1" --> pyyaml
    dagster -- ">=6.1,<=14.0" --> coloredlogs
    dagster -- "any" --> antlr4-python3-runtime
    dagster -- "any" --> docstring-parser
    dagster -- "any" --> filelock
    dagster -- "any" --> jinja2
    dagster -- "any" --> python-dotenv
    dagster -- "any" --> pytz
    dagster -- "any" --> requests
    dagster -- "any" --> rich
    dagster -- "any" --> setuptools
    dagster -- "any" --> six
    dagster -- "any" --> structlog
    dagster -- "any" --> tabulate
    dagster -- "any" --> universal-pathlib
    dagster-graphql -- "==1.9.11" --> dagster
    dagster-graphql -- ">=3,<4" --> gql
    dagster-graphql -- ">=3,<4" --> graphene
    dagster-graphql -- "any" --> requests
    dagster-graphql -- "any" --> starlette
    dagster-postgres -- "==1.9.11" --> dagster
    dagster-postgres -- "any" --> psycopg2-binary
    dagster-webserver -- "!=0.36.0" --> starlette
    dagster-webserver -- "==1.9.11" --> dagster
    dagster-webserver -- "==1.9.11" --> dagster-graphql
    dagster-webserver -- ">=7.0,<9.0" --> click_0
    dagster-webserver -- "any" --> uvicorn
    dependency-groups -- "any" --> packaging
    docker-compose-graph -- "any" --> graphviz
    docker-compose-graph -- "any" --> jinja2
    docker-compose-graph -- "any" --> pydot
    docker-compose-graph -- "any" --> python-dotenv
    docker-compose-graph -- "any" --> pyyaml
    email-validator -- ">=2.0.0" --> dnspython
    email-validator -- ">=2.0.0" --> idna
    gitdb -- ">=3.0.1,<6" --> smmap
    gitpython -- ">=4.0.1,<5" --> gitdb
    gql -- ">=1.11.1,<3.0" --> backoff
    gql -- ">=1.6,<2.0" --> yarl
    gql -- ">=3.0,<5" --> anyio
    gql -- ">=3.2,<3.2.7" --> graphql-core
    graphene -- ">=2.7.0,<3" --> python-dateutil
    graphene -- ">=3.1,<3.3" --> graphql-core
    graphene -- ">=3.1,<3.3" --> graphql-relay
    graphene -- ">=4.7.1,<5" --> typing-extensions
    graphql-relay -- ">=3.2,<3.3" --> graphql-core
    grpcio -- "~=4.12" --> typing-extensions
    grpcio-health-checking -- ">=1.71.2" --> grpcio
    grpcio-health-checking -- ">=5.26.1,<6.0dev" --> protobuf
    isoduration -- ">=0.15.0" --> arrow
    jinja2 -- ">=2.0" --> markupsafe
    jsonschema -- ">=0.25.0" --> rpds-py
    jsonschema -- ">=0.28.4" --> referencing
    jsonschema -- ">=2023.03.6" --> jsonschema-specifications
    jsonschema -- ">=22.2.0" --> attrs
    jsonschema-specifications -- ">=0.31.0" --> referencing
    license-expression -- ">=4.0" --> boolean-py
    mako -- ">=0.9.2" --> markupsafe
    markdown-it-py -- "~=0.1" --> mdurl
    nox -- ">=1.1" --> dependency-groups
    nox -- ">=1.9.4,<4" --> argcomplete
    nox -- ">=2.6.1,<7" --> colorlog
    nox -- ">=20.15" --> virtualenv
    nox -- ">=22" --> packaging
    nox -- ">=24.1" --> attrs
    nox -- ">=4" --> humanize
    openstudiolandscapes -- "==0.25.11" --> dagster-postgres
    openstudiolandscapes -- "==1.9.11" --> dagster
    openstudiolandscapes -- "==1.9.11" --> dagster-webserver
    openstudiolandscapes -- "any" --> docker-compose-graph
    openstudiolandscapes -- "any" --> email-validator
    openstudiolandscapes -- "any" --> gitpython
    openstudiolandscapes -- "any" --> human-readable-id
    openstudiolandscapes -- "any" --> nox
    openstudiolandscapes -- "any" --> openstudiolandscapes-dagstercodelocation-streamingprocess
    openstudiolandscapes -- "any" --> pydot
    openstudiolandscapes -- "any" --> pyyaml
    openstudiolandscapes -- "any" --> snakemd
    openstudiolandscapes-dagstercodelocation-streamingprocess -- "==1.9.11" --> dagster
    openstudiolandscapes-flamenco -- "==1.9.11" --> dagster
    openstudiolandscapes-flamenco -- "any" --> docker-compose-graph
    openstudiolandscapes-flamenco -- "any" --> email-validator
    openstudiolandscapes-flamenco -- "any" --> gitpython
    openstudiolandscapes-flamenco -- "any" --> openstudiolandscapes-dagstercodelocation-streamingprocess
    openstudiolandscapes-flamenco -- "any" --> pyyaml
    openstudiolandscapes-flamenco -- "any" --> snakemd
    openstudiolandscapes-flamenco-worker -- "==1.9.11" --> dagster
    openstudiolandscapes-flamenco-worker -- "any" --> docker-compose-graph
    openstudiolandscapes-flamenco-worker -- "any" --> email-validator
    openstudiolandscapes-flamenco-worker -- "any" --> gitpython
    openstudiolandscapes-flamenco-worker -- "any" --> openstudiolandscapes-dagstercodelocation-streamingprocess
    openstudiolandscapes-flamenco-worker -- "any" --> pyyaml
    openstudiolandscapes-flamenco-worker -- "any" --> snakemd
    pip-requirements-parser -- "any" --> packaging
    pip-requirements-parser -- "any" --> pyparsing
    pipdeptree -- ">=26" --> packaging
    py-serializable -- ">=0.7.1,<0.8.0" --> defusedxml
    pydantic -- "==2.41.5" --> pydantic-core
    pydantic -- ">=0.4.2" --> typing-inspection
    pydantic -- ">=0.6.0" --> annotated-types
    pydantic -- ">=4.14.1" --> typing-extensions
    pydantic-core -- ">=4.14.1" --> typing-extensions
    pydot -- ">=3.1.0" --> pyparsing
    python-dateutil -- ">=1.5" --> six
    python-discovery -- ">=3.15.4" --> filelock
    python-discovery -- ">=4.3.6,<5" --> platformdirs
    referencing -- ">=0.7.0" --> rpds-py
    referencing -- ">=22.2.0" --> attrs
    referencing -- ">=4.4.0" --> typing-extensions
    requests -- ">=1.26,<3" --> urllib3
    requests -- ">=2,<4" --> charset-normalizer
    requests -- ">=2.5,<4" --> idna
    requests -- ">=2023.5.7" --> certifi
    requests-toolbelt -- ">=2.0.1,<3.0.0" --> requests
    rfc3339-validator -- "any" --> six
    rfc3987-syntax -- ">=1.2.2" --> lark
    rich -- ">=2.13.0,<3.0.0" --> pygments
    rich -- ">=2.2.0" --> markdown-it-py
    sqlalchemy -- ">=1" --> greenlet
    sqlalchemy -- ">=4.6.0" --> typing-extensions
    starlette -- ">=3.6.2,<5" --> anyio
    starlette -- ">=4.10.0" --> typing-extensions
    typing-inspection -- ">=4.12.0" --> typing-extensions
    universal-pathlib -- ">=0.5.1,<0.6.0" --> pathlib-abc
    universal-pathlib -- ">=2024.5.0" --> fsspec
    uvicorn -- ">=0.8" --> h11
    uvicorn -- ">=7.0" --> click_0
    virtualenv -- ">=0.3.7,<1" --> distlib
    virtualenv -- ">=1" --> python-discovery
    virtualenv -- ">=3.24.2,<4" --> filelock
    virtualenv -- ">=3.9.1,<5" --> platformdirs
    watchfiles -- ">=3.0.0" --> anyio
    wheel -- ">=24.0" --> packaging
    yarl -- ">=0.2.1" --> propcache
    yarl -- ">=2.0" --> idna
    yarl -- ">=4.0" --> multidict
